## 데이터프레임 생성하기

In [1]:
import pandas as pd

In [3]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [5]:
df = pd.DataFrame(friend_dict_list)

In [6]:
df.head()

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [8]:
df = df[['name','age','job']]

In [9]:
df#컬럼의 순서를 바꿀 수 있으나 번거롭다. 이럴땐 OrderedDict 활용.

   name  age      job
0  John   25  student
1  Nate   30  teacher

## OrderedDict

In [11]:
from collections import OrderedDict

In [12]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', ['25', '30']),
        ('job', ['student', 'teacher'])
    ]
)

In [13]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [14]:
df.head()

   name age      job
0  John  25  student
1  Nate  30  teacher

## 리스트 활용

In [19]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [20]:
column_name = ['name','age','job']

In [21]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [22]:
df.head() #이 방법도 한번에 해결하고싶다면?

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [31]:
friend_list = [
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [32]:
df = pd.DataFrame.from_items(friend_list)

c:\users\hogoo\appdata\local\conda\conda\envs\py37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [33]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher